app/Http/Helpers.php

    function discount_day($user_id)
    {
     $today = Carbon::today();
     $discont = DiscountDay::where('user_id', $user_id)
     ->where('status', 1)
     ->whereDate('discount_date', $today)
     ->value('discount');
---
select `discount` from `discount_days` where `user_id` = 9 and `status` = 1 and date(`discount_date`) = '2025-02-25' limit 1

    function home_base_price($product, $formatted = true)
    {
        $price = $product->unit_price;
        $tax = 0;

        foreach ($product->taxes as $product_tax) {

            $tax_data = TaxValue::where('product_type', 1)->latest()->first();
---
select * from `tax_values` where `product_type` = 1 order by `created_at` desc limit 1


        foreach ($product->taxes as $product_tax) {

            $tax_data = TaxValue::where('product_type', 1)->latest()->first();
---
select * from `tax_values` where `product_type` = 1 order by `created_at` desc limit 1

function translate($key, $lang = null, $addslashes = false)
{
    if ($lang == null) {
        $lang = App::getLocale();
    }


    $lang_key = preg_replace('/[^A-Za-z0-9\_]/', '', str_replace(' ', '_', strtolower($key)));

    $translations_en = Cache::rememberForever('translations-en', function () {
        return Translation::where('lang', 'en')->pluck('lang_value', 'lang_key')->toArray();
---
select `lang_value`, `lang_key` from `translations` where `lang` = 'en'

    function uploaded_asset($id)
    {
        // dd($id);
        if (($asset = \App\Models\Upload::find($id)) != null) {
---
select * from `uploads` where `uploads`.`id` = '546' and `uploads`.`deleted_at` is null limit 1