app/Http/Controllers/LanguageController.php

select * from `languages` where `code` = 'en' limit 1
---
    public function changeLanguage(Request $request)
    {
    	$request->session()->put('locale', $request->locale);
        $language = Language::where('code', $request->locale)->first();